Autodesk.AdvanceSteel.ConstructionTypes.ContourConstructionObject.Accept(Autodesk.AdvanceSteel.Modelling.IVisitor)
implementation for the visitor pattern
visitor: visitor object

Autodesk.AdvanceSteel.ConstructionTypes.ContourConstructionObject.CS
returns the coordinate system for this construction object. It is computed automatically on constructor

Autodesk.AdvanceSteel.ConstructionTypes.ContourConstructionObject.Contour
returns the contour, in the local coordinate system of this object. To get it in WCS you need to apply Autodesk.AdvanceSteel.ConstructionTypes.ContourConstructionObject.CS transformation matrix